In [1]:
import pandas as pd
import numpy as np
import re

# generate datetime index

In [2]:
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

# drop NaN

In [3]:
dropNanDf = pd.DataFrame([
    [1.1, 2.2, 3.3], 
    [4.4, np.NaN, np.NaN],
    [np.NaN, np.NaN, np.NaN], 
    [np.NaN, 11.11, 12.12]
])
dropNanDf

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
2  NaN    NaN    NaN
3  NaN  11.11  12.12

In [4]:
dropNanDf.dropna()

     0    1    2
0  1.1  2.2  3.3

In [5]:
dropNanDf.dropna(how='all')

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
3  NaN  11.11  12.12

In [6]:
dropNanDf.dropna(thresh=2)

     0      1      2
0  1.1   2.20   3.30
3  NaN  11.11  12.12

# fill NaN

In [7]:
fillNanDf = pd.DataFrame([
    [1.1, 2.2, 3.3], 
    [4.4, np.NaN, np.NaN],
    [np.NaN, np.NaN, np.NaN], 
    [np.NaN, 11.11, 12.12]
])
fillNanDf

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
2  NaN    NaN    NaN
3  NaN  11.11  12.12

In [8]:
fillNanDf.fillna(-1)

     0      1      2
0  1.1   2.20   3.30
1  4.4  -1.00  -1.00
2 -1.0  -1.00  -1.00
3 -1.0  11.11  12.12

In [9]:
fillNanDf.fillna({0: - 100, 1: -200, 2: -300})

       0       1       2
0    1.1    2.20    3.30
1    4.4 -200.00 -300.00
2 -100.0 -200.00 -300.00
3 -100.0   11.11   12.12

In [10]:
fillNanDf.fillna(method='ffill')

     0      1      2
0  1.1   2.20   3.30
1  4.4   2.20   3.30
2  4.4   2.20   3.30
3  4.4  11.11  12.12

In [11]:
fillNanDf.fillna(method='ffill', limit=1)

     0      1      2
0  1.1   2.20   3.30
1  4.4   2.20   3.30
2  4.4    NaN    NaN
3  NaN  11.11  12.12

# remove duplicate

In [12]:
removeDuplicateDf = pd.DataFrame({
    'col_0': ['one', 'two'] * 3 + ['two'],
    'col_1': [1, 1, 2, 3, 3, 4, 4]
})
removeDuplicateDf

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4
6   two      4

In [13]:
removeDuplicateDf.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [14]:
removeDuplicateDf.drop_duplicates()

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4

In [15]:
removeDuplicateDf.drop_duplicates(['col_0'])

  col_0  col_1
0   one      1
1   two      1

In [16]:
removeDuplicateDf.drop_duplicates(['col_0'], keep='last')

  col_0  col_1
4   one      3
6   two      4

# mapping data

In [17]:
mappingDataDf = pd.DataFrame({
    'col_0': ['one', 'two'] * 3 + ['two'],
    'col_1': [1, 1, 2, 3, 3, 4, 4]
})
mappingDataDf

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4
6   two      4

In [18]:
mappingData = {
    'one': '111',
    'two': '222'
}
mappingData

{'one': '111', 'two': '222'}

In [19]:
mappingDataDf['col_2'] = mappingDataDf['col_0'].map(mappingData)
mappingDataDf

  col_0  col_1 col_2
0   one      1   111
1   two      1   222
2   one      2   111
3   two      3   222
4   one      3   111
5   two      4   222
6   two      4   222

In [20]:
mappingDataDf['col_3'] = mappingDataDf['col_1'].map(lambda x : x * 10)
mappingDataDf

  col_0  col_1 col_2  col_3
0   one      1   111     10
1   two      1   222     10
2   one      2   111     20
3   two      3   222     30
4   one      3   111     30
5   two      4   222     40
6   two      4   222     40

# replace data

In [21]:
replaceDataDf = pd.DataFrame({
    'col_0': [0, 1, 2],
    'col_1': [1, 2, 3],
    'col_2': [2, 3, 4]
})
replaceDataDf

   col_0  col_1  col_2
0      0      1      2
1      1      2      3
2      2      3      4

In [22]:
replaceDataDf.replace({1: np.nan, 2: 999})

   col_0  col_1  col_2
0    0.0    NaN  999.0
1    NaN  999.0    3.0
2  999.0    3.0    4.0

# binning data

In [23]:
binningDataArr = range(10)
binningDataArr

range(0, 10)

In [24]:
binningCategory = pd.cut(binningDataArr, [0, 3, 7, 10], right=False, labels=['group_0', 'group_1', 'group_2'])
binningCategory.value_counts()

group_0    3
group_1    4
group_2    3
dtype: int64

# quantile binning data

In [25]:
quantileBinningDataArr = range(10)
quantileBinningDataArr

range(0, 10)

In [26]:
quantileBinningCategory = pd.qcut(quantileBinningDataArr, 4, labels=['group_0', 'group_1', 'group_2', 'group_3'])
quantileBinningCategory.value_counts()

group_0    3
group_1    2
group_2    2
group_3    3
dtype: int64

# processing outliers

In [27]:
processingOutliersDf = pd.DataFrame(np.random.randn(1000, 4))
processingOutliersDf.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.024290    -0.013644    -0.007653    -0.022722
std       0.983841     0.963776     1.005689     1.025081
min      -3.184288    -3.392549    -3.006771    -2.758470
25%      -0.649017    -0.665254    -0.692262    -0.745919
50%      -0.009007    -0.049716    -0.054977    -0.024507
75%       0.742625     0.671504     0.648856     0.705392
max       3.020238     2.775171     3.394307     3.465742

In [28]:
processingOutlierColDf = processingOutliersDf[0]
processingOutlierColDf[np.abs(processingOutlierColDf) > 3]

111    3.020238
600   -3.184288
Name: 0, dtype: float64

In [29]:
processingOutliersDf[(np.abs(processingOutliersDf) > 3).any(1)]

            0         1         2         3
18   1.117079  0.310300 -0.933655  3.340034
109 -0.592870 -0.519112 -3.006771  1.361079
111  3.020238  0.421884  1.851760 -1.373482
219 -1.445028 -3.099295  0.257384 -2.284819
361 -0.169063 -1.658470  0.608360  3.465742
600 -3.184288  2.146542 -0.881325 -1.189652
624  0.094992  0.336872  3.394307  0.922970
836  0.599736  0.768038  0.525864  3.033390
842  1.020463 -1.986128  3.171229  0.439654
962  0.488081 -3.392549 -0.818850  0.524156

In [30]:
processingOutliersDf[np.abs(processingOutliersDf) > 3]

      0   1   2         3
0   NaN NaN NaN       NaN
1   NaN NaN NaN       NaN
2   NaN NaN NaN       NaN
3   NaN NaN NaN       NaN
4   NaN NaN NaN       NaN
5   NaN NaN NaN       NaN
6   NaN NaN NaN       NaN
7   NaN NaN NaN       NaN
8   NaN NaN NaN       NaN
9   NaN NaN NaN       NaN
10  NaN NaN NaN       NaN
11  NaN NaN NaN       NaN
12  NaN NaN NaN       NaN
13  NaN NaN NaN       NaN
14  NaN NaN NaN       NaN
15  NaN NaN NaN       NaN
16  NaN NaN NaN       NaN
17  NaN NaN NaN       NaN
18  NaN NaN NaN  3.340034
19  NaN NaN NaN       NaN
20  NaN NaN NaN       NaN
21  NaN NaN NaN       NaN
22  NaN NaN NaN       NaN
23  NaN NaN NaN       NaN
24  NaN NaN NaN       NaN
25  NaN NaN NaN       NaN
26  NaN NaN NaN       NaN
27  NaN NaN NaN       NaN
28  NaN NaN NaN       NaN
29  NaN NaN NaN       NaN
..   ..  ..  ..       ...
970 NaN NaN NaN       NaN
971 NaN NaN NaN       NaN
972 NaN NaN NaN       NaN
973 NaN NaN NaN       NaN
974 NaN NaN NaN       NaN
975 NaN NaN NaN       NaN
976 NaN NaN NaN       NaN
977 NaN NaN NaN       NaN
978 NaN NaN NaN       NaN
979 NaN NaN NaN       NaN
980 NaN NaN NaN       NaN
981 NaN NaN NaN       NaN
982 NaN NaN NaN       NaN
983 NaN NaN NaN       NaN
984 NaN NaN NaN       NaN
985 NaN NaN NaN       NaN
986 NaN NaN NaN       NaN
987 NaN NaN NaN       NaN
988 NaN NaN NaN       NaN
989 NaN NaN NaN       NaN
990 NaN NaN NaN       NaN
991 NaN NaN NaN       NaN
992 NaN NaN NaN       NaN
993 NaN NaN NaN       NaN
994 NaN NaN NaN       NaN
995 NaN NaN NaN       NaN
996 NaN NaN NaN       NaN
997 NaN NaN NaN       NaN
998 NaN NaN NaN       NaN
999 NaN NaN NaN       NaN

[1000 rows x 4 columns]

In [31]:
processingOutliersDf[np.abs(processingOutliersDf) > 3] = np.sign(processingOutliersDf) * 3
processingOutliersDf

            0         1         2         3
0    1.130670  0.286027 -1.365768 -0.236195
1    0.939172  0.699501  1.189895 -0.979461
2   -1.136555 -0.040395  0.153876 -0.235864
3   -0.722295 -1.529103 -0.897711 -0.344310
4    0.904341 -0.183510  0.488359  1.473038
5    0.274489 -1.093369  0.517638 -1.139070
6    1.661969  0.462754  2.323653 -0.529238
7   -0.010258  1.433307  0.394644 -0.523258
8   -0.363973 -1.398269  1.319785  0.012721
9    0.641540 -0.438663  0.456106 -0.338422
10   1.547812 -1.211422 -0.368446 -0.303734
11  -0.695633  1.206766  2.019437  0.831103
12   0.443992  2.212961  1.215222  1.275216
13  -0.373849  1.782053  1.280930  0.467922
14  -0.364673  1.383163 -0.662042 -0.165063
15  -0.007729 -0.083861 -0.023933  0.116719
16  -1.505194  1.135000  0.921279 -1.043467
17  -0.309003 -0.013593 -0.643938  0.309375
18   1.117079  0.310300 -0.933655  3.000000
19  -0.349575  1.070573 -0.415137 -0.189715
20  -0.398020 -0.872637 -0.390495  0.451997
21   0.561794  1.145321  0.826756  0.660011
22  -0.016794  0.664602  0.276372 -0.233025
23  -1.321449  0.256129 -0.087082 -2.102219
24   1.906243 -1.740832  0.091568 -0.588214
25  -0.087176 -1.276792  0.894396  0.324114
26  -1.798034 -0.054500  1.195508  1.304399
27   0.782192  0.170904  0.099709 -1.642593
28   1.200597 -0.461464 -0.389514 -2.024087
29  -0.526888  0.530433 -0.083859  0.622675
..        ...       ...       ...       ...
970 -0.066572  1.048908  0.240723 -1.150543
971  0.476384  1.427353 -0.481875  0.155268
972  0.494020 -0.220758  1.451840  1.639448
973 -2.717923  0.349530  2.280955 -0.566670
974  1.646474  1.250020 -0.197425  1.711542
975  0.504480 -0.527920 -0.404343 -0.317696
976 -0.299062  1.252773  1.986057 -1.593398
977 -0.168624 -0.965334  0.271579 -1.656817
978 -0.377572  0.048857 -0.827393  0.364943
979  0.181805 -0.797521  0.499831  0.920684
980  0.072373 -0.344108 -0.122366 -0.751295
981 -0.400842 -1.149251  0.392741  0.219133
982  0.839736 -2.138779  0.812112 -0.739301
983  0.541903 -0.579179  1.079137 -0.129096
984 -0.083504 -0.805474  0.149196  0.140733
985 -1.141727 -1.024900 -0.000898 -0.602018
986  1.133723  0.476078  0.754247  0.683079
987 -1.372316 -0.594680 -0.236195  0.756383
988 -0.419990  1.193718  0.443972 -0.297224
989  1.029710  1.395281 -0.217098  0.661232
990 -0.601549  0.224666  1.404455 -0.918680
991  0.072816 -0.325517 -0.077744 -0.047501
992  0.800838 -0.620871  0.763320 -0.096507
993 -1.824306  0.583349 -0.199925  0.856992
994 -0.629246  0.112417 -1.004838  0.507205
995  1.633902 -0.503767 -1.066890 -0.256975
996 -0.357838 -0.889500 -0.220054 -1.759691
997 -0.569186  1.416788  1.052858 -0.700804
998  1.166542  0.079839 -0.660513 -0.082252
999  1.045367 -0.168167 -0.557056 -1.714228

[1000 rows x 4 columns]

# sampling data

In [32]:
samplingDataDf = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
samplingDataDf

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [33]:
samplingDataSampler = np.random.permutation(5)
samplingDataSampler

array([0, 4, 3, 1, 2])

In [34]:
samplingDataDf.take(samplingDataSampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [35]:
samplingDataDf.sample(n=3)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7

# dummy variable

In [36]:
dummyVariableDf = pd.DataFrame({'col_0': ['b', 'b', 'a', 'c', 'a', 'b']})
dummyVariableDf

  col_0
0     b
1     b
2     a
3     c
4     a
5     b

In [37]:
pd.get_dummies(dummyVariableDf['col_0'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [38]:
dummyVariable = np.random.rand(10)
dummyVariable

array([0.78821501, 0.53316194, 0.64619846, 0.67087166, 0.68815645,
       0.63843844, 0.12880829, 0.24834596, 0.05333795, 0.89217007])

In [39]:
dummyVariableBins = [0, 0.2, 0.4, 0.6, 0.8, 1]
dummyVariableBins

[0, 0.2, 0.4, 0.6, 0.8, 1]

In [40]:
pd.get_dummies(pd.cut(dummyVariable, dummyVariableBins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           1           0
1           0           0           1           0           0
2           0           0           0           1           0
3           0           0           0           1           0
4           0           0           0           1           0
5           0           0           0           1           0
6           1           0           0           0           0
7           0           1           0           0           0
8           1           0           0           0           0
9           0           0           0           0           1

# string function

In [41]:
stringFunctionDf = pd.DataFrame({
    'col_0': ['abc', 'xyz', '123']
})
stringFunctionDf

  col_0
0   abc
1   xyz
2   123

In [42]:
stringFunctionDf['col_0'].str.contains('xy')

0    False
1     True
2    False
Name: col_0, dtype: bool

In [43]:
stringFunctionDf['col_0'].str.findall('[a1]', flags=re.IGNORECASE)

0    [a]
1     []
2    [1]
Name: col_0, dtype: object

In [44]:
stringFunctionDf['col_0'].str.match('[a1]', flags=re.IGNORECASE)

0     True
1    False
2     True
Name: col_0, dtype: bool